# Data Cleaning
Before manipulating or analyzing the data, you should critically appraise to detect and fix any problems.  You should find any icnomplete, incorrect, incaccurate, or irrelevant parts of the data and then decide on replacing, modyfying, or deleting those parts to have a clean dataset to work with.    

Let's look at a dataset that needs a bit of review and data cleanng. We will use the [room_temperature](https://raw.githubusercontent.com/cwbassim/IBEHS_4C03/main/room_temperature.csv?token=AWHGY67PF3VM53B2WYVW6PLBPQ7G6)  dataset, a .csv file with temperature measurements (in Kelvin) from 4 corners of a room.  

We will reset any user defined variables to create a clean run and import the dataframe by using the %reset call. 

This is my workspace and nobody else can see what I'm doing here

In [2]:
%reset
import numpy as np
import pandas as pd
room_temperatures = pd.read_csv("room_temperatures.csv")
print(room_temperatures)

Once deleted, variables cannot be recovered. Proceed (y/[n])?  y

                Date  FrontLeft FrontRight  BackLeft  BackRight
0    4/11/2010 11:30      295.2        297     295.8      296.3
1    4/11/2010 12:00      296.2      296.4     296.2      296.3
2    4/11/2010 12:30      297.3      297.5     296.7      297.1
3    4/11/2010 13:00      295.9      296.7     297.4      297.0
4    4/11/2010 13:30      297.2      296.5     297.6      297.4
..               ...        ...        ...       ...        ...
141   4/14/2010 9:30      294.8      295.5     294.7      295.6
142  4/14/2010 10:00      295.9      295.8     295.5      295.2
143  4/14/2010 10:30      295.1      296.2     296.0      296.1
144  4/14/2010 11:00      296.2      297.2     296.6      296.0
145  4/14/2010 11:15       -1.0        300      -7.0      300.0

[146 rows x 5 columns]

# Tidying data types in the dataframe
We want to clean specific columns and make sure that they are in the data type that want and enforce consistency.  Let's check on the datatypes.  Here we can confirm that all the columns are floating point numbers, which is what we want.  If we have to, you can tranfrom to a numerical data type with pd.to_numeric.  There is an errors argment that can be used to deal with data values that cannot be coverted to a number: you can coerrce the data value into NaN or ignore the call.  Here, we will 'coerece' data values that cannot be converted to a number (here there is missing data in the value) to be coded as NaN, which can be advantageous because it's easy to work with  NaN values in python

You can also use the argument downcast to specify the data type.  To.numeric has the following data types:
pd.to_numeric( , downcast='signed') is int8\
pd.to_numeric( , downcast='float') is float32\
The default is int64 or float 64

Data type conversions for other data type spectification:\
pd.to_datetime()\
pd.Categorical()\

You can also use the .astype() to specfiy the data type for conversion.

In [3]:
room_temperatures.dtypes

Date           object
FrontLeft     float64
FrontRight     object
BackLeft      float64
BackRight     float64
dtype: object

In [4]:
room_temperatures["FrontRight"] = pd.to_numeric(room_temperatures["FrontRight"],errors='coerce')
room_temperatures.dtypes

Date           object
FrontLeft     float64
FrontRight    float64
BackLeft      float64
BackRight     float64
dtype: object

# Dropping unnecessary columns and manipulating columns in the dataframe
Let's describe the columns of the data and drop the date column.  Pandas provides a handy way to remove unwanted colmns or rows from a dataframe with the drop() function.

In [5]:
print(room_temperatures.columns)
room_temperatures = room_temperatures.drop(columns=['Date'])
print(room_temperatures)

Index(['Date', 'FrontLeft', 'FrontRight', 'BackLeft', 'BackRight'], dtype='object')
     FrontLeft  FrontRight  BackLeft  BackRight
0        295.2       297.0     295.8      296.3
1        296.2       296.4     296.2      296.3
2        297.3       297.5     296.7      297.1
3        295.9       296.7     297.4      297.0
4        297.2       296.5     297.6      297.4
..         ...         ...       ...        ...
141      294.8       295.5     294.7      295.6
142      295.9       295.8     295.5      295.2
143      295.1       296.2     296.0      296.1
144      296.2       297.2     296.6      296.0
145       -1.0       300.0      -7.0      300.0

[146 rows x 4 columns]

Instead of importing the date column and dropping it, you can import the data but replace the default index (a list of 0 to n-1, where n is the number of data points) with the date as the index.

In [6]:
changed_index_to_date_room_temperatures = pd.read_csv("room-temperature.csv", delimiter=',', index_col='Date')
print(changed_index_to_date_room_temperatures)

                 FrontLeft  FrontRight  BackLeft  BackRight
Date
4/11/2010 11:30      295.2       297.0     295.8      296.3
4/11/2010 12:00      296.2       296.4     296.2      296.3
4/11/2010 12:30      297.3       297.5     296.7      297.1
4/11/2010 13:00      295.9       296.7     297.4      297.0
4/11/2010 13:30      297.2       296.5     297.6      297.4
...                    ...         ...       ...        ...
4/14/2010 9:00       295.8       294.6     294.8      295.7
4/14/2010 9:30       294.8       295.5     294.7      295.6
4/14/2010 10:00      295.9       295.8     295.5      295.2
4/14/2010 10:30      295.1       296.2     296.0      296.1
4/14/2010 11:00      296.2       297.2     296.6      296.0

[144 rows x 4 columns]

In [7]:
room_temperatures.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146 entries, 0 to 145
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   FrontLeft   146 non-null    float64
 1   FrontRight  145 non-null    float64
 2   BackLeft    146 non-null    float64
 3   BackRight   146 non-null    float64
dtypes: float64(4)
memory usage: 4.7 KB

You can define new columns based on existing ones. Here let's create a new column that is the difference between the front left and front rght temperatures of the room.  We can check that we added a column looking at the new shape of the dataframe.

In [8]:
room_temperatures["new_column_difference_FL-FR"] = room_temperatures.FrontLeft-room_temperatures.FrontRight
room_temperatures.info()
print(room_temperatures)
room_temperatures.shape

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146 entries, 0 to 145
Data columns (total 5 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   FrontLeft                    146 non-null    float64
 1   FrontRight                   145 non-null    float64
 2   BackLeft                     146 non-null    float64
 3   BackRight                    146 non-null    float64
 4   new_column_difference_FL-FR  145 non-null    float64
dtypes: float64(5)
memory usage: 5.8 KB
     FrontLeft  FrontRight  BackLeft  BackRight  new_column_difference_FL-FR
0        295.2       297.0     295.8      296.3                         -1.8
1        296.2       296.4     296.2      296.3                         -0.2
2        297.3       297.5     296.7      297.1                         -0.2
3        295.9       296.7     297.4      297.0                         -0.8
4        297.2       296.5     297.6      297.4                          0.7
..         ...         ...       ...        ...                          ...
141      294.8       295.5     294.7      295.6                         -0.7
142      295.9       295.8     295.5      295.2                          0.1
143      295.1       296.2     296.0      296.1                         -1.1
144      296.2       297.2     296.6      296.0                         -1.0
145       -1.0       300.0      -7.0      300.0                       -301.0

[146 rows x 5 columns]

(146, 5)

You can rename columns of the dataframe.  If we wanted to change the name of our new column from new_column_difference_FL-FR to the more simple name of FL-FR, you can rename the columns names.  Here we will overwrite the exsting dataframe to remane this column and then chek the info about the dataframe again.

In [9]:
room_temperatures = room_temperatures.rename(columns = {"new_column_difference_FL-FR": "FL-FR"})
room_temperatures.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146 entries, 0 to 145
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   FrontLeft   146 non-null    float64
 1   FrontRight  145 non-null    float64
 2   BackLeft    146 non-null    float64
 3   BackRight   146 non-null    float64
 4   FL-FR       145 non-null    float64
dtypes: float64(5)
memory usage: 5.8 KB

# Missing Data

Now lets inspect the dataframe using .info().  The .info() attribute for the dataset shows if there are any null values for any columns. If there was missing data for any values then we could ignore any rows that have missing data using .dropna().

In [10]:
room_temperatures.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146 entries, 0 to 145
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   FrontLeft   146 non-null    float64
 1   FrontRight  145 non-null    float64
 2   BackLeft    146 non-null    float64
 3   BackRight   146 non-null    float64
 4   FL-FR       145 non-null    float64
dtypes: float64(5)
memory usage: 5.8 KB

In [11]:
print(room_temperatures.tail(10))
room_temperatures.shape

     FrontLeft  FrontRight  BackLeft  BackRight  FL-FR
136      295.8       294.8     294.0      294.1    1.0
137      294.4       295.4     294.2      294.4   -1.0
138      295.8       295.6     295.4      295.6    0.2
139      300.0         NaN     300.0     7000.0    NaN
140      295.8       294.6     294.8      295.7    1.2
141      294.8       295.5     294.7      295.6   -0.7
142      295.9       295.8     295.5      295.2    0.1
143      295.1       296.2     296.0      296.1   -1.1
144      296.2       297.2     296.6      296.0   -1.0
145       -1.0       300.0      -7.0      300.0 -301.0

(146, 5)

In [12]:
rows_without_null_data = room_temperatures.dropna()
rows_without_null_data.info()
rows_without_null_data.shape

<class 'pandas.core.frame.DataFrame'>
Int64Index: 145 entries, 0 to 145
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   FrontLeft   145 non-null    float64
 1   FrontRight  145 non-null    float64
 2   BackLeft    145 non-null    float64
 3   BackRight   145 non-null    float64
 4   FL-FR       145 non-null    float64
dtypes: float64(5)
memory usage: 6.8 KB

(145, 5)

# Dataframe query

A query for a dataset is a request for data results or for an action on the data. There are many ways to query the columns of a Dataframe with a boolean expression.  This in efect filters the rows of the panda dataframe. 

Let's look at some examples for different ways to query the dataframe.  The first will be to convert bad data to 'NaN' (not a number) values and then to remove them.  This is advantageous because it's easy to replace NaN values in python.

# Invalid data
Invalid data can be even more worrying than missing values.  These are non-null values but if you use them you could have misleading or incorrect results.  You can do an invalid value review with queries and aggregations.

First, let's validate the ranges of the data.  We will use the .describe() function to provide some asic descripve statistics for the columns of the dataset dataset. I'll first make a simplier dataframe with 3 significant digits and the last coulumn sliced away.

In [24]:
pd.options.display.float_format = '{:.3f}'.format
room_temps=rows_without_null_data[rows_without_null_data.columns[:-1]]
room_temps.describe()

       FrontLeft  FrontRight  BackLeft  BackRight
count    145.000     145.000   145.000    145.000
mean     292.470     294.666   292.979    295.012
std       24.595       1.766    25.135      1.694
min       -1.000     291.100    -7.000    292.100
25%      293.100     293.300   293.600    293.500
50%      294.400     294.400   295.100    295.000
75%      295.800     295.800   296.300    296.500
max      298.100     300.000   297.600    300.000

The min values looks stange here.  How can the tempertaure in Kelvin be negative, and 7000K seems like an unlkely valid value?  Let's query the dataframe on columns, basically filtering or selecting specific rows.

# Method 1 Square brackets column indexing
First we will use Pandas indexing to subet the dataframe, by creating a Boolean series and using it to filter the dataframe. This can be by a single column, all columns, or selcted columns.  The Boolean expresssions can be combined.

In [25]:
# Filter one a specific column
room_temps[room_temps.FrontLeft < 0]

     FrontLeft  FrontRight  BackLeft  BackRight
145     -1.000     300.000    -7.000    300.000

In [26]:
# Filter on all columns.  Here the filter comverts the bad data to NaN (not a number) value.
# This is useful because it easy to manipulate NaN values in pandas.
room_temps[room_temps > 0]

     FrontLeft  FrontRight  BackLeft  BackRight
0      295.200     297.000   295.800    296.300
1      296.200     296.400   296.200    296.300
2      297.300     297.500   296.700    297.100
3      295.900     296.700   297.400    297.000
4      297.200     296.500   297.600    297.400
..         ...         ...       ...        ...
141    294.800     295.500   294.700    295.600
142    295.900     295.800   295.500    295.200
143    295.100     296.200   296.000    296.100
144    296.200     297.200   296.600    296.000
145        NaN     300.000       NaN    300.000

[145 rows x 4 columns]

In [34]:
# Now we will create a new dataframe with NaNs replaing anything les than 0 or greater than 350 Kelvin.  
room_temps_cleaned = room_temps[(0 < room_temps) & (room_temps < 350)]
print(room_temps_cleaned.tail(20))

     FrontLeft  FrontRight  BackLeft  BackRight
125    292.700     292.400   293.100    293.500
126    292.200     294.200   292.400    292.100
127    292.800     292.600   293.300    292.800
128    293.500     293.600   293.100    292.200
129    293.300     292.600   294.500    292.900
130    292.700     293.400   297.400    292.700
131    292.100     293.000   292.400    293.000
132    292.200     293.200   294.600    292.500
133    294.400     293.800   294.000    294.100
134    294.700     293.700   294.600    293.500
135    294.500     294.100   294.900    293.900
136    295.800     294.800   294.000    294.100
137    294.400     295.400   294.200    294.400
138    295.800     295.600   295.400    295.600
140    295.800     294.600   294.800    295.700
141    294.800     295.500   294.700    295.600
142    295.900     295.800   295.500    295.200
143    295.100     296.200   296.000    296.100
144    296.200     297.200   296.600    296.000
145        NaN     300.000       NaN    300.000

In [35]:
# There are many ways to replace NaN values in python.  Here we will simply delete the rows with any NaN values.  
# Remember that axis=1 is column adn axis=0 is for rows in indexing.  
# There is a very useful Pandas Dataframe drop command used to delete columns or rows from the Dataframe in general, and not just for NaNs
room_temps_cleaned = room_temps_cleaned.dropna(axis=0)
print(room_temps_cleaned.tail(20))

     FrontLeft  FrontRight  BackLeft  BackRight
124    292.700     293.800   292.100    292.500
125    292.700     292.400   293.100    293.500
126    292.200     294.200   292.400    292.100
127    292.800     292.600   293.300    292.800
128    293.500     293.600   293.100    292.200
129    293.300     292.600   294.500    292.900
130    292.700     293.400   297.400    292.700
131    292.100     293.000   292.400    293.000
132    292.200     293.200   294.600    292.500
133    294.400     293.800   294.000    294.100
134    294.700     293.700   294.600    293.500
135    294.500     294.100   294.900    293.900
136    295.800     294.800   294.000    294.100
137    294.400     295.400   294.200    294.400
138    295.800     295.600   295.400    295.600
140    295.800     294.600   294.800    295.700
141    294.800     295.500   294.700    295.600
142    295.900     295.800   295.500    295.200
143    295.100     296.200   296.000    296.100
144    296.200     297.200   296.600    296.000

# Method 2 is using the location labeling of the dataframe.  
Let's use .loc to filter the dataframe.

In [57]:
bad_room_temp_data = room_temps.loc[(room_temps["FrontLeft"] <0)]
print(bad_room_temp_data.tail(20))

     FrontLeft  FrontRight  BackLeft  BackRight
145     -1.000     300.000    -7.000    300.000

# Method 3 Use of the pandas .query function
A [pandas Dataframe query](pandas.pydata.org/docs/reference/frame.html) is a way to query the columns of a Dataframe with a boolean expression.  The .query( ,inplace=TRUE) returns no new dataframe and .query( ,inplace=FALSE) returns a new dataframe resulting from the provided query expression (FALSE is the deafult). The query expressions can be used with multiple conditions.

In [63]:
print(room_temperatures.tail(20))

     FrontLeft  FrontRight  BackLeft  BackRight    FL-FR
126    292.200     294.200   292.400    292.100   -2.000
127    292.800     292.600   293.300    292.800    0.200
128    293.500     293.600   293.100    292.200   -0.100
129    293.300     292.600   294.500    292.900    0.700
130    292.700     293.400   297.400    292.700   -0.700
131    292.100     293.000   292.400    293.000   -0.900
132    292.200     293.200   294.600    292.500   -1.000
133    294.400     293.800   294.000    294.100    0.600
134    294.700     293.700   294.600    293.500    1.000
135    294.500     294.100   294.900    293.900    0.400
136    295.800     294.800   294.000    294.100    1.000
137    294.400     295.400   294.200    294.400   -1.000
138    295.800     295.600   295.400    295.600    0.200
139    300.000         NaN   300.000   7000.000      NaN
140    295.800     294.600   294.800    295.700    1.200
141    294.800     295.500   294.700    295.600   -0.700
142    295.900     295.800   295.500    295.200    0.100
143    295.100     296.200   296.000    296.100   -1.100
144    296.200     297.200   296.600    296.000   -1.000
145     -1.000     300.000    -7.000    300.000 -301.000

In [58]:
room_temperatures.query('FrontLeft < 0')

     FrontLeft  FrontRight  BackLeft  BackRight    FL-FR
145     -1.000     300.000    -7.000    300.000 -301.000

In [59]:
room_temperatures.query('not(0 < FrontLeft and BackRight and BackLeft and BackRight < 350)')

     FrontLeft  FrontRight  BackLeft  BackRight    FL-FR
139    300.000         NaN   300.000   7000.000      NaN
145     -1.000     300.000    -7.000    300.000 -301.000

In [61]:
good_dataA = room_temperatures.query('0 < FrontLeft and BackRight and BackLeft and BackRight < 350')
print(good_dataA.tail(20))
good_dataA.shape

     FrontLeft  FrontRight  BackLeft  BackRight  FL-FR
124    292.700     293.800   292.100    292.500 -1.100
125    292.700     292.400   293.100    293.500  0.300
126    292.200     294.200   292.400    292.100 -2.000
127    292.800     292.600   293.300    292.800  0.200
128    293.500     293.600   293.100    292.200 -0.100
129    293.300     292.600   294.500    292.900  0.700
130    292.700     293.400   297.400    292.700 -0.700
131    292.100     293.000   292.400    293.000 -0.900
132    292.200     293.200   294.600    292.500 -1.000
133    294.400     293.800   294.000    294.100  0.600
134    294.700     293.700   294.600    293.500  1.000
135    294.500     294.100   294.900    293.900  0.400
136    295.800     294.800   294.000    294.100  1.000
137    294.400     295.400   294.200    294.400 -1.000
138    295.800     295.600   295.400    295.600  0.200
140    295.800     294.600   294.800    295.700  1.200
141    294.800     295.500   294.700    295.600 -0.700
142    295.900     295.800   295.500    295.200  0.100
143    295.100     296.200   296.000    296.100 -1.100
144    296.200     297.200   296.600    296.000 -1.000

(144, 5)

You can see that we have dropped the two rows that had invalid data and returned a dataframe that now only has valid data in it.

When the data has many columns, manually writing out the query statements can be tedious.  There are a few ways to deal with this, using iterations.  

Let's look at using a for loop to loop over the columns.

In [64]:
dummy_room_temperaturesA = room_temperatures.copy()
for colname in dummy_room_temperaturesA.drop(columns=["FL-FR"]):
    query_string = "0 < " + colname + " < 350"
    dummy_room_temperaturesA = dummy_room_temperaturesA.query(query_string)
print(dummy_room_temperaturesA.tail(20))

     FrontLeft  FrontRight  BackLeft  BackRight  FL-FR
124    292.700     293.800   292.100    292.500 -1.100
125    292.700     292.400   293.100    293.500  0.300
126    292.200     294.200   292.400    292.100 -2.000
127    292.800     292.600   293.300    292.800  0.200
128    293.500     293.600   293.100    292.200 -0.100
129    293.300     292.600   294.500    292.900  0.700
130    292.700     293.400   297.400    292.700 -0.700
131    292.100     293.000   292.400    293.000 -0.900
132    292.200     293.200   294.600    292.500 -1.000
133    294.400     293.800   294.000    294.100  0.600
134    294.700     293.700   294.600    293.500  1.000
135    294.500     294.100   294.900    293.900  0.400
136    295.800     294.800   294.000    294.100  1.000
137    294.400     295.400   294.200    294.400 -1.000
138    295.800     295.600   295.400    295.600  0.200
140    295.800     294.600   294.800    295.700  1.200
141    294.800     295.500   294.700    295.600 -0.700
142    295.900     295.800   295.500    295.200  0.100
143    295.100     296.200   296.000    296.100 -1.100
144    296.200     297.200   296.600    296.000 -1.000